app/controllers/setlists_controller.rb

SELECT "setlists".* FROM "setlists" WHERE "setlists"."user_id" = $1  [["user_id", 1]]
---
  def index
    @setlists = Setlist.where(user_id: @user.id)

INSERT INTO "setlists" ("name", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Set List 1"], ["created_at", "2020-11-24 16:35:54.886032"], ["updated_at", "2020-11-24 16:35:54.886032"], ["user_id", 1]]
---
  def create
    @setlist = Setlist.new(setlist_params)
    @setlist.user_id = @user.id

    if @setlist.save

SELECT "setlists".* FROM "setlists" WHERE "setlists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_setlist
      @setlist = Setlist.find(params[:id])