app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs"
---
  def index
    @songs = Song.all

INSERT INTO "songs" ("name", "artist", "lyrics", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @song = Song.new(song_params)

    if @song.save

SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 76327180], ["LIMIT", 1]]
---
    def set_song
      @song = Song.find(params[:id])